# 패치셋 업그레이드 롤백 검증
Tags: DEVICE.p_real_cent.ini, DEVICE.cpp_attacker.ini

## 신규설치
* "VS_DUT01"에서 설치파일 다운로드 및 install(Local)
* "VS_DUT01"에서 기본 정책을 백업 한다
* 3초 동안 대기
\* "VS_DUT01"에서 제품이 설치된 버전을 확인한다
* "VS_DUT01"에서 제품이 설치된 디렉토리를 확인한다
* "VS_DUT01"에서 제품 툴이 설치된 디렉토리를 확인한다
* "VS_DUT01"에서 데몬 구동상태를 확인한다

## 롤백 패치셋 업데이트
* "VS_DUT01"에서 롤백 패치셋 업데이트
* "VS_DUT01"에서 제품이 설치된 디렉토리를 확인한다
* "VS_DUT01"에서 제품 툴이 설치된 디렉토리를 확인한다
* "VS_DUT01"에서 데몬 구동상태를 확인한다
* "VS_DUT01"에서 제품버전 확인 - "1.0.8."
* "VS_DUT01"에서 엔진버전 확인 - "1.0.8."

## 업그레이드 패치셋 업데이트
* "VS_DUT01"에서 업그레이드 패치셋 업데이트
* "VS_DUT01"에서 제품이 설치된 디렉토리를 확인한다
* "VS_DUT01"에서 제품 툴이 설치된 디렉토리를 확인한다
* "VS_DUT01"에서 데몬 구동상태를 확인한다
* "VS_DUT01"에서 제품버전 확인 - "1.0.9."
* "VS_DUT01"에서 엔진버전 확인 - "1.0.9."